- replaced ASCII diagram by mermaid - add tutorial for doc writing
